{
 "cells": [
  {
   "cell_type": "markdown",
   "source": [
    "for handling /chatbot response\n"
   ],
   "metadata": {
    "collapsed": false
   },
   "id": "c42d523e1e528bd5"
  },
  {
   "cell_type": "code",
   "outputs": [],
   "source": [],
   "metadata": {
    "collapsed": false
   },
   "id": "c07dec8410e0fdf"
  },
  {
   "cell_type": "code",
   "outputs": [],
   "source": [
    "import json\n",
    "import re\n",
    "\n",
    "response = \"```\\n{\\n    \\\"action\\\": \\\"perceptor_query\\\",\\n    \\\"action_input\\\": \\\"MATCH (d:device) WHERE d.role = 'pdu' AND d.site = 'pdx01' RETURN count(d)\\\"\\n}\\n```\"\n",
    "\n",
    "response1 = \"\"\"```json\\n{\\n    \\\"action\\\": \\\"Final Answer\\\",\\n    \\\"action_input\\\": \\\"There are 4677 PDUs in the Pdx01 site.\\\"\\n}\\n```\\nReference:\\n```json\\n{\\n    \\\"action\\\": \\\"perceptor_query\\\",\\n    \\\"action_input\\\": \\\"MATCH (d:device) WHERE d.role = 'pdu' AND d.site = 'pdx01' RETURN count(d)\\\"\\n}\\n```\"\"\"\n",
    "\n",
    "\n",
    "response2 = \"\"\"{\\\"results\\\": [{\\\"keys\\\": [\\\"count(d)\\\"], \\\"records\\\": [{\\\"Values\\\": [4677], \\\"Keys\\\": [\\\"count(d)\\\"]}], \\\"summary\\\": {}}], \\\"queryId\\\": \\\"\\\", \\\"query\\\": \\\"MATCH (d:device) WHERE d.role = 'pdu' AND d.site = 'pdx01' RETURN count(d)\\\", \\\"backendTimeMillis\\\": 300}\"\"\""
   ],
   "metadata": {
    "collapsed": false,
    "ExecuteTime": {
     "end_time": "2024-08-02T22:47:58.698578Z",
     "start_time": "2024-08-02T22:47:58.694154Z"
    }
   },
   "id": "f25099a664f0a759",
   "execution_count": 33
  },
  {
   "cell_type": "code",
   "outputs": [],
   "source": [
    "pattern = re.compile(r\"^.*?`{3}(?:json)?\\n(.*?)`{3}.*?$\", re.DOTALL)"
   ],
   "metadata": {
    "collapsed": false,
    "ExecuteTime": {
     "end_time": "2024-08-02T22:45:23.318603Z",
     "start_time": "2024-08-02T22:45:23.314130Z"
    }
   },
   "id": "bdf8380c8f043eb3",
   "execution_count": 24
  },
  {
   "cell_type": "code",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "tool='perceptor_query' tool_input=\"MATCH (d:device) WHERE d.role = 'pdu' AND d.site = 'pdx01' RETURN count(d)\" log='```\\n{\\n    \"action\": \"perceptor_query\",\\n    \"action_input\": \"MATCH (d:device) WHERE d.role = \\'pdu\\' AND d.site = \\'pdx01\\' RETURN count(d)\"\\n}\\n```'\n"
     ]
    }
   ],
   "source": [
    "\n",
    "\n",
    "from langchain.agents.chat.output_parser import ChatOutputParser\n",
    "\n",
    "action = ChatOutputParser().parse(response)\n",
    "print (action)"
   ],
   "metadata": {
    "collapsed": false,
    "ExecuteTime": {
     "end_time": "2024-08-02T23:13:38.417211Z",
     "start_time": "2024-08-02T23:13:38.412991Z"
    }
   },
   "id": "2fd31fe7f90ae710",
   "execution_count": 36
  },
  {
   "cell_type": "code",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Final Answer\n",
      "There are 4677 PDUs in the Pdx01 site.\n",
      "AgentAction\n",
      "dict_keys(['tool', 'tool_input', 'log', 'type'])\n"
     ]
    }
   ],
   "source": [
    "answer = ChatOutputParser().parse(response1)\n",
    "print (answer.tool)\n",
    "print (answer.tool_input)\n",
    "print (answer.type)\n",
    "print (answer.dict().keys())"
   ],
   "metadata": {
    "collapsed": false,
    "ExecuteTime": {
     "end_time": "2024-08-02T23:15:28.726375Z",
     "start_time": "2024-08-02T23:15:28.708870Z"
    }
   },
   "id": "8704f710625c6a5b",
   "execution_count": 43
  },
  {
   "cell_type": "code",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'results': [{'keys': ['count(d)'], 'records': [{'Values': [4677], 'Keys': ['count(d)']}], 'summary': {}}], 'queryId': '', 'query': \"MATCH (d:device) WHERE d.role = 'pdu' AND d.site = 'pdx01' RETURN count(d)\", 'backendTimeMillis': 300}\n"
     ]
    }
   ],
   "source": [
    "# random = ChatOutputParser().parse(response3)\n",
    "random = json.loads(response2)\n",
    "print (random)"
   ],
   "metadata": {
    "collapsed": false,
    "ExecuteTime": {
     "end_time": "2024-08-02T23:48:21.190611Z",
     "start_time": "2024-08-02T23:48:21.188119Z"
    }
   },
   "id": "8346e0c6553ea16c",
   "execution_count": 45
  },
  {
   "cell_type": "code",
   "outputs": [],
   "source": [],
   "metadata": {
    "collapsed": false
   },
   "id": "7eccaeefb4624610"
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
